RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/cci_reg.h
/* 0x754 : audio_pll_cfg1 */
#define CCI_AUDIO_PLL_CFG1_OFFSET   (0x754)
#define CCI_AUPLL_POSTDIV           CCI_AUPLL_POSTDIV
#define CCI_AUPLL_POSTDIV_POS       (0U)
#define CCI_AUPLL_POSTDIV_LEN       (7U)
#define CCI_AUPLL_POSTDIV_MSK       (((1U << CCI_AUPLL_POSTDIV_LEN) - 1) << CCI_AUPLL_POSTDIV_POS)
#define CCI_AUPLL_POSTDIV_UMSK      (~(((1U << CCI_AUPLL_POSTDIV_LEN) - 1) << CCI_AUPLL_POSTDIV_POS))
#define CCI_AUPLL_REFDIV_RATIO      CCI_AUPLL_REFDIV_RATIO
#define CCI_AUPLL_REFDIV_RATIO_POS  (8U)
#define CCI_AUPLL_REFDIV_RATIO_LEN  (4U)
#define CCI_AUPLL_REFDIV_RATIO_MSK  (((1U << CCI_AUPLL_REFDIV_RATIO_LEN) - 1) << CCI_AUPLL_REFDIV_RATIO_POS)
#define CCI_AUPLL_REFDIV_RATIO_UMSK (~(((1U << CCI_AUPLL_REFDIV_RATIO_LEN) - 1) << CCI_AUPLL_REFDIV_RATIO_POS))
#define CCI_AUPLL_REFCLK_SEL        CCI_AUPLL_REFCLK_SEL
#define CCI_AUPLL_REFCLK_SEL_POS    (16U)
#define CCI_AUPLL_REFCLK_SEL_LEN    (2U)
#define CCI_AUPLL_REFCLK_SEL_MSK    (((1U << CCI_AUPLL_REFCLK_SEL_LEN) - 1) << CCI_AUPLL_REFCLK_SEL_POS)
#define CCI_AUPLL_REFCLK_SEL_UMSK   (~(((1U << CCI_AUPLL_REFCLK_SEL_LEN) - 1) << CCI_AUPLL_REFCLK_SEL_POS))
#define CCI_AUPLL_VG11_SEL          CCI_AUPLL_VG11_SEL
#define CCI_AUPLL_VG11_SEL_POS      (20U)
#define CCI_AUPLL_VG11_SEL_LEN      (2U)
#define CCI_AUPLL_VG11_SEL_MSK      (((1U << CCI_AUPLL_VG11_SEL_LEN) - 1) << CCI_AUPLL_VG11_SEL_POS)
#define CCI_AUPLL_VG11_SEL_UMSK     (~(((1U << CCI_AUPLL_VG11_SEL_LEN) - 1) << CCI_AUPLL_VG11_SEL_POS))
#define CCI_AUPLL_VG13_SEL          CCI_AUPLL_VG13_SEL
#define CCI_AUPLL_VG13_SEL_POS      (24U)
#define CCI_AUPLL_VG13_SEL_LEN      (2U)
#define CCI_AUPLL_VG13_SEL_MSK      (((1U << CCI_AUPLL_VG13_SEL_LEN) - 1) << CCI_AUPLL_VG13_SEL_POS)
#define CCI_AUPLL_VG13_SEL_UMSK     (~(((1U << CCI_AUPLL_VG13_SEL_LEN) - 1) << CCI_AUPLL_VG13_SEL_POS))

/* 0x758 : audio_pll_cfg2 */
#define CCI_AUDIO_PLL_CFG2_OFFSET    (0x758)
#define CCI_AUPLL_SEL_CP_BIAS        CCI_AUPLL_SEL_CP_BIAS
#define CCI_AUPLL_SEL_CP_BIAS_POS    (0U)
#define CCI_AUPLL_SEL_CP_BIAS_LEN    (1U)
#define CCI_AUPLL_SEL_CP_BIAS_MSK    (((1U << CCI_AUPLL_SEL_CP_BIAS_LEN) - 1) << CCI_AUPLL_SEL_CP_BIAS_POS)
#define CCI_AUPLL_SEL_CP_BIAS_UMSK   (~(((1U << CCI_AUPLL_SEL_CP_BIAS_LEN) - 1) << CCI_AUPLL_SEL_CP_BIAS_POS))
#define CCI_AUPLL_ICP_5U             CCI_AUPLL_ICP_5U
#define CCI_AUPLL_ICP_5U_POS         (4U)
#define CCI_AUPLL_ICP_5U_LEN         (2U)
#define CCI_AUPLL_ICP_5U_MSK         (((1U << CCI_AUPLL_ICP_5U_LEN) - 1) << CCI_AUPLL_ICP_5U_POS)
#define CCI_AUPLL_ICP_5U_UMSK        (~(((1U << CCI_AUPLL_ICP_5U_LEN) - 1) << CCI_AUPLL_ICP_5U_POS))
#define CCI_AUPLL_ICP_1U             CCI_AUPLL_ICP_1U
#define CCI_AUPLL_ICP_1U_POS         (6U)
#define CCI_AUPLL_ICP_1U_LEN         (2U)
#define CCI_AUPLL_ICP_1U_MSK         (((1U << CCI_AUPLL_ICP_1U_LEN) - 1) << CCI_AUPLL_ICP_1U_POS)
#define CCI_AUPLL_ICP_1U_UMSK        (~(((1U << CCI_AUPLL_ICP_1U_LEN) - 1) << CCI_AUPLL_ICP_1U_POS))
#define CCI_AUPLL_INT_FRAC_SW        CCI_AUPLL_INT_FRAC_SW
#define CCI_AUPLL_INT_FRAC_SW_POS    (8U)
#define CCI_AUPLL_INT_FRAC_SW_LEN    (1U)
#define CCI_AUPLL_INT_FRAC_SW_MSK    (((1U << CCI_AUPLL_INT_FRAC_SW_LEN) - 1) << CCI_AUPLL_INT_FRAC_SW_POS)
#define CCI_AUPLL_INT_FRAC_SW_UMSK   (~(((1U << CCI_AUPLL_INT_FRAC_SW_LEN) - 1) << CCI_AUPLL_INT_FRAC_SW_POS))
#define CCI_AUPLL_CP_STARTUP_EN      CCI_AUPLL_CP_STARTUP_EN
#define CCI_AUPLL_CP_STARTUP_EN_POS  (9U)
#define CCI_AUPLL_CP_STARTUP_EN_LEN  (1U)
#define CCI_AUPLL_CP_STARTUP_EN_MSK  (((1U << CCI_AUPLL_CP_STARTUP_EN_LEN) - 1) << CCI_AUPLL_CP_STARTUP_EN_POS)
#define CCI_AUPLL_CP_STARTUP_EN_UMSK (~(((1U << CCI_AUPLL_CP_STARTUP_EN_LEN) - 1) << CCI_AUPLL_CP_STARTUP_EN_POS))
#define CCI_AUPLL_CP_OPAMP_EN        CCI_AUPLL_CP_OPAMP_EN
#define CCI_AUPLL_CP_OPAMP_EN_POS    (10U)
#define CCI_AUPLL_CP_OPAMP_EN_LEN    (1U)
#define CCI_AUPLL_CP_OPAMP_EN_MSK    (((1U << CCI_AUPLL_CP_OPAMP_EN_LEN) - 1) << CCI_AUPLL_CP_OPAMP_EN_POS)
#define CCI_AUPLL_CP_OPAMP_EN_UMSK   (~(((1U << CCI_AUPLL_CP_OPAMP_EN_LEN) - 1) << CCI_AUPLL_CP_OPAMP_EN_POS))

/* 0x75C : audio_pll_cfg3 */
#define CCI_AUDIO_PLL_CFG3_OFFSET (0x75C)
#define CCI_AUPLL_C4_EN           CCI_AUPLL_C4_EN
#define CCI_AUPLL_C4_EN_POS       (0U)
#define CCI_AUPLL_C4_EN_LEN       (1U)
#define CCI_AUPLL_C4_EN_MSK       (((1U << CCI_AUPLL_C4_EN_LEN) - 1) << CCI_AUPLL_C4_EN_POS)
#define CCI_AUPLL_C4_EN_UMSK      (~(((1U << CCI_AUPLL_C4_EN_LEN) - 1) << CCI_AUPLL_C4_EN_POS))
#define CCI_AUPLL_R4              CCI_AUPLL_R4
#define CCI_AUPLL_R4_POS          (4U)
#define CCI_AUPLL_R4_LEN          (2U)
#define CCI_AUPLL_R4_MSK          (((1U << CCI_AUPLL_R4_LEN) - 1) << CCI_AUPLL_R4_POS)
#define CCI_AUPLL_R4_UMSK         (~(((1U << CCI_AUPLL_R4_LEN) - 1) << CCI_AUPLL_R4_POS))
#define CCI_AUPLL_R4_SHORT        CCI_AUPLL_R4_SHORT
#define CCI_AUPLL_R4_SHORT_POS    (8U)
#define CCI_AUPLL_R4_SHORT_LEN    (1U)
#define CCI_AUPLL_R4_SHORT_MSK    (((1U << CCI_AUPLL_R4_SHORT_LEN) - 1) << CCI_AUPLL_R4_SHORT_POS)
#define CCI_AUPLL_R4_SHORT_UMSK   (~(((1U << CCI_AUPLL_R4_SHORT_LEN) - 1) << CCI_AUPLL_R4_SHORT_POS))
#define CCI_AUPLL_C3              CCI_AUPLL_C3
#define CCI_AUPLL_C3_POS          (12U)
#define CCI_AUPLL_C3_LEN          (2U)
#define CCI_AUPLL_C3_MSK          (((1U << CCI_AUPLL_C3_LEN) - 1) << CCI_AUPLL_C3_POS)
#define CCI_AUPLL_C3_UMSK         (~(((1U << CCI_AUPLL_C3_LEN) - 1) << CCI_AUPLL_C3_POS))
#define CCI_AUPLL_CZ              CCI_AUPLL_CZ
#define CCI_AUPLL_CZ_POS          (14U)
#define CCI_AUPLL_CZ_LEN          (2U)
#define CCI_AUPLL_CZ_MSK          (((1U << CCI_AUPLL_CZ_LEN) - 1) << CCI_AUPLL_CZ_POS)
#define CCI_AUPLL_CZ_UMSK         (~(((1U << CCI_AUPLL_CZ_LEN) - 1) << CCI_AUPLL_CZ_POS))
#define CCI_AUPLL_RZ              CCI_AUPLL_RZ
#define CCI_AUPLL_RZ_POS          (16U)
#define CCI_AUPLL_RZ_LEN          (3U)
#define CCI_AUPLL_RZ_MSK          (((1U << CCI_AUPLL_RZ_LEN) - 1) << CCI_AUPLL_RZ_POS)
#define CCI_AUPLL_RZ_UMSK         (~(((1U << CCI_AUPLL_RZ_LEN) - 1) << CCI_AUPLL_RZ_POS))

/* 0x760 : audio_pll_cfg4 */
#define CCI_AUDIO_PLL_CFG4_OFFSET     (0x760)
#define CCI_AUPLL_SEL_SAMPLE_CLK      CCI_AUPLL_SEL_SAMPLE_CLK
#define CCI_AUPLL_SEL_SAMPLE_CLK_POS  (0U)
#define CCI_AUPLL_SEL_SAMPLE_CLK_LEN  (2U)
#define CCI_AUPLL_SEL_SAMPLE_CLK_MSK  (((1U << CCI_AUPLL_SEL_SAMPLE_CLK_LEN) - 1) << CCI_AUPLL_SEL_SAMPLE_CLK_POS)
#define CCI_AUPLL_SEL_SAMPLE_CLK_UMSK (~(((1U << CCI_AUPLL_SEL_SAMPLE_CLK_LEN) - 1) << CCI_AUPLL_SEL_SAMPLE_CLK_POS))
#define CCI_AUPLL_SEL_FB_CLK          CCI_AUPLL_SEL_FB_CLK
#define CCI_AUPLL_SEL_FB_CLK_POS      (4U)
#define CCI_AUPLL_SEL_FB_CLK_LEN      (2U)
#define CCI_AUPLL_SEL_FB_CLK_MSK      (((1U << CCI_AUPLL_SEL_FB_CLK_LEN) - 1) << CCI_AUPLL_SEL_FB_CLK_POS)
#define CCI_AUPLL_SEL_FB_CLK_UMSK     (~(((1U << CCI_AUPLL_SEL_FB_CLK_LEN) - 1) << CCI_AUPLL_SEL_FB_CLK_POS))
#define CCI_AUPLL_SDMCLK_SEL          CCI_AUPLL_SDMCLK_SEL
#define CCI_AUPLL_SDMCLK_SEL_POS      (8U)
#define CCI_AUPLL_SDMCLK_SEL_LEN      (1U)
#define CCI_AUPLL_SDMCLK_SEL_MSK      (((1U << CCI_AUPLL_SDMCLK_SEL_LEN) - 1) << CCI_AUPLL_SDMCLK_SEL_POS)
#define CCI_AUPLL_SDMCLK_SEL_UMSK     (~(((1U << CCI_AUPLL_SDMCLK_SEL_LEN) - 1) << CCI_AUPLL_SDMCLK_SEL_POS))

/* 0x764 : audio_pll_cfg5 */
#define CCI_AUDIO_PLL_CFG5_OFFSET (0x764)
#define CCI_AUPLL_VCO_SPEED       CCI_AUPLL_VCO_SPEED
#define CCI_AUPLL_VCO_SPEED_POS   (0U)
#define CCI_AUPLL_VCO_SPEED_LEN   (3U)
#define CCI_AUPLL_VCO_SPEED_MSK   (((1U << CCI_AUPLL_VCO_SPEED_LEN) - 1) << CCI_AUPLL_VCO_SPEED_POS)
#define CCI_AUPLL_VCO_SPEED_UMSK  (~(((1U << CCI_AUPLL_VCO_SPEED_LEN) - 1) << CCI_AUPLL_VCO_SPEED_POS))

