RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/cci_reg.h
/* 0x768 : audio_pll_cfg6 */
#define CCI_AUDIO_PLL_CFG6_OFFSET (0x768)
#define CCI_AUPLL_SDMIN           CCI_AUPLL_SDMIN
#define CCI_AUPLL_SDMIN_POS       (0U)
#define CCI_AUPLL_SDMIN_LEN       (19U)
#define CCI_AUPLL_SDMIN_MSK       (((1U << CCI_AUPLL_SDMIN_LEN) - 1) << CCI_AUPLL_SDMIN_POS)
#define CCI_AUPLL_SDMIN_UMSK      (~(((1U << CCI_AUPLL_SDMIN_LEN) - 1) << CCI_AUPLL_SDMIN_POS))
#define CCI_AUPLL_SDM_BYPASS      CCI_AUPLL_SDM_BYPASS
#define CCI_AUPLL_SDM_BYPASS_POS  (24U)
#define CCI_AUPLL_SDM_BYPASS_LEN  (1U)
#define CCI_AUPLL_SDM_BYPASS_MSK  (((1U << CCI_AUPLL_SDM_BYPASS_LEN) - 1) << CCI_AUPLL_SDM_BYPASS_POS)
#define CCI_AUPLL_SDM_BYPASS_UMSK (~(((1U << CCI_AUPLL_SDM_BYPASS_LEN) - 1) << CCI_AUPLL_SDM_BYPASS_POS))

/* 0x76C : audio_pll_cfg7 */
#define CCI_AUDIO_PLL_CFG7_OFFSET       (0x76C)
#define CCI_AUPLL_SDM_ORDER_SEL         CCI_AUPLL_SDM_ORDER_SEL
#define CCI_AUPLL_SDM_ORDER_SEL_POS     (0U)
#define CCI_AUPLL_SDM_ORDER_SEL_LEN     (1U)
#define CCI_AUPLL_SDM_ORDER_SEL_MSK     (((1U << CCI_AUPLL_SDM_ORDER_SEL_LEN) - 1) << CCI_AUPLL_SDM_ORDER_SEL_POS)
#define CCI_AUPLL_SDM_ORDER_SEL_UMSK    (~(((1U << CCI_AUPLL_SDM_ORDER_SEL_LEN) - 1) << CCI_AUPLL_SDM_ORDER_SEL_POS))
#define CCI_AUPLL_SDM_SIG_DITH_SEL      CCI_AUPLL_SDM_SIG_DITH_SEL
#define CCI_AUPLL_SDM_SIG_DITH_SEL_POS  (16U)
#define CCI_AUPLL_SDM_SIG_DITH_SEL_LEN  (2U)
#define CCI_AUPLL_SDM_SIG_DITH_SEL_MSK  (((1U << CCI_AUPLL_SDM_SIG_DITH_SEL_LEN) - 1) << CCI_AUPLL_SDM_SIG_DITH_SEL_POS)
#define CCI_AUPLL_SDM_SIG_DITH_SEL_UMSK (~(((1U << CCI_AUPLL_SDM_SIG_DITH_SEL_LEN) - 1) << CCI_AUPLL_SDM_SIG_DITH_SEL_POS))

/* 0x770 : audio_pll_cfg8 */
#define CCI_AUDIO_PLL_CFG8_OFFSET    (0x770)
#define CCI_AUPLL_EN_DIV1            CCI_AUPLL_EN_DIV1
#define CCI_AUPLL_EN_DIV1_POS        (0U)
#define CCI_AUPLL_EN_DIV1_LEN        (1U)
#define CCI_AUPLL_EN_DIV1_MSK        (((1U << CCI_AUPLL_EN_DIV1_LEN) - 1) << CCI_AUPLL_EN_DIV1_POS)
#define CCI_AUPLL_EN_DIV1_UMSK       (~(((1U << CCI_AUPLL_EN_DIV1_LEN) - 1) << CCI_AUPLL_EN_DIV1_POS))
#define CCI_AUPLL_EN_DIV2            CCI_AUPLL_EN_DIV2
#define CCI_AUPLL_EN_DIV2_POS        (1U)
#define CCI_AUPLL_EN_DIV2_LEN        (1U)
#define CCI_AUPLL_EN_DIV2_MSK        (((1U << CCI_AUPLL_EN_DIV2_LEN) - 1) << CCI_AUPLL_EN_DIV2_POS)
#define CCI_AUPLL_EN_DIV2_UMSK       (~(((1U << CCI_AUPLL_EN_DIV2_LEN) - 1) << CCI_AUPLL_EN_DIV2_POS))
#define CCI_AUPLL_EN_DIV2P5          CCI_AUPLL_EN_DIV2P5
#define CCI_AUPLL_EN_DIV2P5_POS      (2U)
#define CCI_AUPLL_EN_DIV2P5_LEN      (1U)
#define CCI_AUPLL_EN_DIV2P5_MSK      (((1U << CCI_AUPLL_EN_DIV2P5_LEN) - 1) << CCI_AUPLL_EN_DIV2P5_POS)
#define CCI_AUPLL_EN_DIV2P5_UMSK     (~(((1U << CCI_AUPLL_EN_DIV2P5_LEN) - 1) << CCI_AUPLL_EN_DIV2P5_POS))
#define CCI_AUPLL_EN_DIV3            CCI_AUPLL_EN_DIV3
#define CCI_AUPLL_EN_DIV3_POS        (3U)
#define CCI_AUPLL_EN_DIV3_LEN        (1U)
#define CCI_AUPLL_EN_DIV3_MSK        (((1U << CCI_AUPLL_EN_DIV3_LEN) - 1) << CCI_AUPLL_EN_DIV3_POS)
#define CCI_AUPLL_EN_DIV3_UMSK       (~(((1U << CCI_AUPLL_EN_DIV3_LEN) - 1) << CCI_AUPLL_EN_DIV3_POS))
#define CCI_AUPLL_EN_DIV4            CCI_AUPLL_EN_DIV4
#define CCI_AUPLL_EN_DIV4_POS        (4U)
#define CCI_AUPLL_EN_DIV4_LEN        (1U)
#define CCI_AUPLL_EN_DIV4_MSK        (((1U << CCI_AUPLL_EN_DIV4_LEN) - 1) << CCI_AUPLL_EN_DIV4_POS)
#define CCI_AUPLL_EN_DIV4_UMSK       (~(((1U << CCI_AUPLL_EN_DIV4_LEN) - 1) << CCI_AUPLL_EN_DIV4_POS))
#define CCI_AUPLL_EN_DIV5            CCI_AUPLL_EN_DIV5
#define CCI_AUPLL_EN_DIV5_POS        (5U)
#define CCI_AUPLL_EN_DIV5_LEN        (1U)
#define CCI_AUPLL_EN_DIV5_MSK        (((1U << CCI_AUPLL_EN_DIV5_LEN) - 1) << CCI_AUPLL_EN_DIV5_POS)
#define CCI_AUPLL_EN_DIV5_UMSK       (~(((1U << CCI_AUPLL_EN_DIV5_LEN) - 1) << CCI_AUPLL_EN_DIV5_POS))
#define CCI_AUPLL_EN_DIV6            CCI_AUPLL_EN_DIV6
#define CCI_AUPLL_EN_DIV6_POS        (6U)
#define CCI_AUPLL_EN_DIV6_LEN        (1U)
#define CCI_AUPLL_EN_DIV6_MSK        (((1U << CCI_AUPLL_EN_DIV6_LEN) - 1) << CCI_AUPLL_EN_DIV6_POS)
#define CCI_AUPLL_EN_DIV6_UMSK       (~(((1U << CCI_AUPLL_EN_DIV6_LEN) - 1) << CCI_AUPLL_EN_DIV6_POS))
#define CCI_AUPLL_EN_DIV10           CCI_AUPLL_EN_DIV10
#define CCI_AUPLL_EN_DIV10_POS       (7U)
#define CCI_AUPLL_EN_DIV10_LEN       (1U)
#define CCI_AUPLL_EN_DIV10_MSK       (((1U << CCI_AUPLL_EN_DIV10_LEN) - 1) << CCI_AUPLL_EN_DIV10_POS)
#define CCI_AUPLL_EN_DIV10_UMSK      (~(((1U << CCI_AUPLL_EN_DIV10_LEN) - 1) << CCI_AUPLL_EN_DIV10_POS))
#define CCI_AUPLL_EN_DIV15           CCI_AUPLL_EN_DIV15
#define CCI_AUPLL_EN_DIV15_POS       (8U)
#define CCI_AUPLL_EN_DIV15_LEN       (1U)
#define CCI_AUPLL_EN_DIV15_MSK       (((1U << CCI_AUPLL_EN_DIV15_LEN) - 1) << CCI_AUPLL_EN_DIV15_POS)
#define CCI_AUPLL_EN_DIV15_UMSK      (~(((1U << CCI_AUPLL_EN_DIV15_LEN) - 1) << CCI_AUPLL_EN_DIV15_POS))
#define CCI_AUPLL_SEL_DIV1_DIV2      CCI_AUPLL_SEL_DIV1_DIV2
#define CCI_AUPLL_SEL_DIV1_DIV2_POS  (9U)
#define CCI_AUPLL_SEL_DIV1_DIV2_LEN  (1U)
#define CCI_AUPLL_SEL_DIV1_DIV2_MSK  (((1U << CCI_AUPLL_SEL_DIV1_DIV2_LEN) - 1) << CCI_AUPLL_SEL_DIV1_DIV2_POS)
#define CCI_AUPLL_SEL_DIV1_DIV2_UMSK (~(((1U << CCI_AUPLL_SEL_DIV1_DIV2_LEN) - 1) << CCI_AUPLL_SEL_DIV1_DIV2_POS))

/* 0x774 : audio_pll_cfg9 */
#define CCI_AUDIO_PLL_CFG9_OFFSET       (0x774)
#define CCI_AUPLL_DC_TP_OUT_EN          CCI_AUPLL_DC_TP_OUT_EN
#define CCI_AUPLL_DC_TP_OUT_EN_POS      (0U)
#define CCI_AUPLL_DC_TP_OUT_EN_LEN      (1U)
#define CCI_AUPLL_DC_TP_OUT_EN_MSK      (((1U << CCI_AUPLL_DC_TP_OUT_EN_LEN) - 1) << CCI_AUPLL_DC_TP_OUT_EN_POS)
#define CCI_AUPLL_DC_TP_OUT_EN_UMSK     (~(((1U << CCI_AUPLL_DC_TP_OUT_EN_LEN) - 1) << CCI_AUPLL_DC_TP_OUT_EN_POS))
#define CCI_TEN_AUPLL                   CCI_TEN_AUPLL
#define CCI_TEN_AUPLL_POS               (1U)
#define CCI_TEN_AUPLL_LEN               (1U)
#define CCI_TEN_AUPLL_MSK               (((1U << CCI_TEN_AUPLL_LEN) - 1) << CCI_TEN_AUPLL_POS)
#define CCI_TEN_AUPLL_UMSK              (~(((1U << CCI_TEN_AUPLL_LEN) - 1) << CCI_TEN_AUPLL_POS))
#define CCI_TEN_AUPLL_SFREG             CCI_TEN_AUPLL_SFREG
#define CCI_TEN_AUPLL_SFREG_POS         (2U)
#define CCI_TEN_AUPLL_SFREG_LEN         (1U)
#define CCI_TEN_AUPLL_SFREG_MSK         (((1U << CCI_TEN_AUPLL_SFREG_LEN) - 1) << CCI_TEN_AUPLL_SFREG_POS)
#define CCI_TEN_AUPLL_SFREG_UMSK        (~(((1U << CCI_TEN_AUPLL_SFREG_LEN) - 1) << CCI_TEN_AUPLL_SFREG_POS))
#define CCI_DTEN_AUPLL_FIN              CCI_DTEN_AUPLL_FIN
#define CCI_DTEN_AUPLL_FIN_POS          (4U)
#define CCI_DTEN_AUPLL_FIN_LEN          (1U)
#define CCI_DTEN_AUPLL_FIN_MSK          (((1U << CCI_DTEN_AUPLL_FIN_LEN) - 1) << CCI_DTEN_AUPLL_FIN_POS)
#define CCI_DTEN_AUPLL_FIN_UMSK         (~(((1U << CCI_DTEN_AUPLL_FIN_LEN) - 1) << CCI_DTEN_AUPLL_FIN_POS))
#define CCI_DTEN_AUPLL_FREF             CCI_DTEN_AUPLL_FREF
#define CCI_DTEN_AUPLL_FREF_POS         (5U)
#define CCI_DTEN_AUPLL_FREF_LEN         (1U)
#define CCI_DTEN_AUPLL_FREF_MSK         (((1U << CCI_DTEN_AUPLL_FREF_LEN) - 1) << CCI_DTEN_AUPLL_FREF_POS)
#define CCI_DTEN_AUPLL_FREF_UMSK        (~(((1U << CCI_DTEN_AUPLL_FREF_LEN) - 1) << CCI_DTEN_AUPLL_FREF_POS))
#define CCI_DTEN_AUPLL_FSDM             CCI_DTEN_AUPLL_FSDM
#define CCI_DTEN_AUPLL_FSDM_POS         (6U)
#define CCI_DTEN_AUPLL_FSDM_LEN         (1U)
#define CCI_DTEN_AUPLL_FSDM_MSK         (((1U << CCI_DTEN_AUPLL_FSDM_LEN) - 1) << CCI_DTEN_AUPLL_FSDM_POS)
#define CCI_DTEN_AUPLL_FSDM_UMSK        (~(((1U << CCI_DTEN_AUPLL_FSDM_LEN) - 1) << CCI_DTEN_AUPLL_FSDM_POS))
#define CCI_DTEN_AUPLL_DIV15            CCI_DTEN_AUPLL_DIV15
#define CCI_DTEN_AUPLL_DIV15_POS        (7U)
#define CCI_DTEN_AUPLL_DIV15_LEN        (1U)
#define CCI_DTEN_AUPLL_DIV15_MSK        (((1U << CCI_DTEN_AUPLL_DIV15_LEN) - 1) << CCI_DTEN_AUPLL_DIV15_POS)
#define CCI_DTEN_AUPLL_DIV15_UMSK       (~(((1U << CCI_DTEN_AUPLL_DIV15_LEN) - 1) << CCI_DTEN_AUPLL_DIV15_POS))
#define CCI_DTEN_AUPLL_DIV5             CCI_DTEN_AUPLL_DIV5
#define CCI_DTEN_AUPLL_DIV5_POS         (8U)
#define CCI_DTEN_AUPLL_DIV5_LEN         (1U)
#define CCI_DTEN_AUPLL_DIV5_MSK         (((1U << CCI_DTEN_AUPLL_DIV5_LEN) - 1) << CCI_DTEN_AUPLL_DIV5_POS)
#define CCI_DTEN_AUPLL_DIV5_UMSK        (~(((1U << CCI_DTEN_AUPLL_DIV5_LEN) - 1) << CCI_DTEN_AUPLL_DIV5_POS))
#define CCI_DTEN_AUPLL_POSTDIV_CLK      CCI_DTEN_AUPLL_POSTDIV_CLK
#define CCI_DTEN_AUPLL_POSTDIV_CLK_POS  (9U)
#define CCI_DTEN_AUPLL_POSTDIV_CLK_LEN  (1U)
#define CCI_DTEN_AUPLL_POSTDIV_CLK_MSK  (((1U << CCI_DTEN_AUPLL_POSTDIV_CLK_LEN) - 1) << CCI_DTEN_AUPLL_POSTDIV_CLK_POS)
#define CCI_DTEN_AUPLL_POSTDIV_CLK_UMSK (~(((1U << CCI_DTEN_AUPLL_POSTDIV_CLK_LEN) - 1) << CCI_DTEN_AUPLL_POSTDIV_CLK_POS))
#define CCI_DTEST_AUPLL_PULLDOWN        CCI_DTEST_AUPLL_PULLDOWN
#define CCI_DTEST_AUPLL_PULLDOWN_POS    (10U)
#define CCI_DTEST_AUPLL_PULLDOWN_LEN    (1U)
#define CCI_DTEST_AUPLL_PULLDOWN_MSK    (((1U << CCI_DTEST_AUPLL_PULLDOWN_LEN) - 1) << CCI_DTEST_AUPLL_PULLDOWN_POS)
#define CCI_DTEST_AUPLL_PULLDOWN_UMSK   (~(((1U << CCI_DTEST_AUPLL_PULLDOWN_LEN) - 1) << CCI_DTEST_AUPLL_PULLDOWN_POS))

/* 0x778 : audio_pll_cfg10 */
#define CCI_AUDIO_PLL_CFG10_OFFSET       (0x778)
#define CCI_AUPLL_SSC_EN                 CCI_AUPLL_SSC_EN
#define CCI_AUPLL_SSC_EN_POS             (0U)
#define CCI_AUPLL_SSC_EN_LEN             (1U)
#define CCI_AUPLL_SSC_EN_MSK             (((1U << CCI_AUPLL_SSC_EN_LEN) - 1) << CCI_AUPLL_SSC_EN_POS)
#define CCI_AUPLL_SSC_EN_UMSK            (~(((1U << CCI_AUPLL_SSC_EN_LEN) - 1) << CCI_AUPLL_SSC_EN_POS))
#define CCI_AUPLL_SSC_CNT                CCI_AUPLL_SSC_CNT
#define CCI_AUPLL_SSC_CNT_POS            (4U)
#define CCI_AUPLL_SSC_CNT_LEN            (8U)
#define CCI_AUPLL_SSC_CNT_MSK            (((1U << CCI_AUPLL_SSC_CNT_LEN) - 1) << CCI_AUPLL_SSC_CNT_POS)
#define CCI_AUPLL_SSC_CNT_UMSK           (~(((1U << CCI_AUPLL_SSC_CNT_LEN) - 1) << CCI_AUPLL_SSC_CNT_POS))
#define CCI_AUPLL_SSC_GAIN               CCI_AUPLL_SSC_GAIN
#define CCI_AUPLL_SSC_GAIN_POS           (12U)
#define CCI_AUPLL_SSC_GAIN_LEN           (3U)
#define CCI_AUPLL_SSC_GAIN_MSK           (((1U << CCI_AUPLL_SSC_GAIN_LEN) - 1) << CCI_AUPLL_SSC_GAIN_POS)
#define CCI_AUPLL_SSC_GAIN_UMSK          (~(((1U << CCI_AUPLL_SSC_GAIN_LEN) - 1) << CCI_AUPLL_SSC_GAIN_POS))
#define CCI_AUPLL_SSC_START_GATE_EN      CCI_AUPLL_SSC_START_GATE_EN
#define CCI_AUPLL_SSC_START_GATE_EN_POS  (16U)
#define CCI_AUPLL_SSC_START_GATE_EN_LEN  (1U)
#define CCI_AUPLL_SSC_START_GATE_EN_MSK  (((1U << CCI_AUPLL_SSC_START_GATE_EN_LEN) - 1) << CCI_AUPLL_SSC_START_GATE_EN_POS)
#define CCI_AUPLL_SSC_START_GATE_EN_UMSK (~(((1U << CCI_AUPLL_SSC_START_GATE_EN_LEN) - 1) << CCI_AUPLL_SSC_START_GATE_EN_POS))
#define CCI_AUPLL_SSC_START              CCI_AUPLL_SSC_START
#define CCI_AUPLL_SSC_START_POS          (20U)
#define CCI_AUPLL_SSC_START_LEN          (1U)
#define CCI_AUPLL_SSC_START_MSK          (((1U << CCI_AUPLL_SSC_START_LEN) - 1) << CCI_AUPLL_SSC_START_POS)
#define CCI_AUPLL_SSC_START_UMSK         (~(((1U << CCI_AUPLL_SSC_START_LEN) - 1) << CCI_AUPLL_SSC_START_POS))

/* 0x77C : audio_pll_cfg11 */
#define CCI_AUDIO_PLL_CFG11_OFFSET (0x77C)
#define CCI_AUPLL_RESV             CCI_AUPLL_RESV
#define CCI_AUPLL_RESV_POS         (0U)
#define CCI_AUPLL_RESV_LEN         (16U)
#define CCI_AUPLL_RESV_MSK         (((1U << CCI_AUPLL_RESV_LEN) - 1) << CCI_AUPLL_RESV_POS)
#define CCI_AUPLL_RESV_UMSK        (~(((1U << CCI_AUPLL_RESV_LEN) - 1) << CCI_AUPLL_RESV_POS))
#define CCI_AUPLL_DL_CTRL_15       CCI_AUPLL_DL_CTRL_15
#define CCI_AUPLL_DL_CTRL_15_POS   (23U)
#define CCI_AUPLL_DL_CTRL_15_LEN   (1U)
#define CCI_AUPLL_DL_CTRL_15_MSK   (((1U << CCI_AUPLL_DL_CTRL_15_LEN) - 1) << CCI_AUPLL_DL_CTRL_15_POS)
#define CCI_AUPLL_DL_CTRL_15_UMSK  (~(((1U << CCI_AUPLL_DL_CTRL_15_LEN) - 1) << CCI_AUPLL_DL_CTRL_15_POS))
#define CCI_AUPLL_DL_CTRL_10       CCI_AUPLL_DL_CTRL_10
#define CCI_AUPLL_DL_CTRL_10_POS   (24U)
#define CCI_AUPLL_DL_CTRL_10_LEN   (1U)
#define CCI_AUPLL_DL_CTRL_10_MSK   (((1U << CCI_AUPLL_DL_CTRL_10_LEN) - 1) << CCI_AUPLL_DL_CTRL_10_POS)
#define CCI_AUPLL_DL_CTRL_10_UMSK  (~(((1U << CCI_AUPLL_DL_CTRL_10_LEN) - 1) << CCI_AUPLL_DL_CTRL_10_POS))
#define CCI_AUPLL_DL_CTRL_6        CCI_AUPLL_DL_CTRL_6
#define CCI_AUPLL_DL_CTRL_6_POS    (25U)
#define CCI_AUPLL_DL_CTRL_6_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_6_MSK    (((1U << CCI_AUPLL_DL_CTRL_6_LEN) - 1) << CCI_AUPLL_DL_CTRL_6_POS)
#define CCI_AUPLL_DL_CTRL_6_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_6_LEN) - 1) << CCI_AUPLL_DL_CTRL_6_POS))
#define CCI_AUPLL_DL_CTRL_5        CCI_AUPLL_DL_CTRL_5
#define CCI_AUPLL_DL_CTRL_5_POS    (26U)
#define CCI_AUPLL_DL_CTRL_5_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_5_MSK    (((1U << CCI_AUPLL_DL_CTRL_5_LEN) - 1) << CCI_AUPLL_DL_CTRL_5_POS)
#define CCI_AUPLL_DL_CTRL_5_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_5_LEN) - 1) << CCI_AUPLL_DL_CTRL_5_POS))
#define CCI_AUPLL_DL_CTRL_4        CCI_AUPLL_DL_CTRL_4
#define CCI_AUPLL_DL_CTRL_4_POS    (27U)
#define CCI_AUPLL_DL_CTRL_4_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_4_MSK    (((1U << CCI_AUPLL_DL_CTRL_4_LEN) - 1) << CCI_AUPLL_DL_CTRL_4_POS)
#define CCI_AUPLL_DL_CTRL_4_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_4_LEN) - 1) << CCI_AUPLL_DL_CTRL_4_POS))
#define CCI_AUPLL_DL_CTRL_3        CCI_AUPLL_DL_CTRL_3
#define CCI_AUPLL_DL_CTRL_3_POS    (28U)
#define CCI_AUPLL_DL_CTRL_3_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_3_MSK    (((1U << CCI_AUPLL_DL_CTRL_3_LEN) - 1) << CCI_AUPLL_DL_CTRL_3_POS)
#define CCI_AUPLL_DL_CTRL_3_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_3_LEN) - 1) << CCI_AUPLL_DL_CTRL_3_POS))
#define CCI_AUPLL_DL_CTRL_2P5      CCI_AUPLL_DL_CTRL_2P5
#define CCI_AUPLL_DL_CTRL_2P5_POS  (29U)
#define CCI_AUPLL_DL_CTRL_2P5_LEN  (1U)
#define CCI_AUPLL_DL_CTRL_2P5_MSK  (((1U << CCI_AUPLL_DL_CTRL_2P5_LEN) - 1) << CCI_AUPLL_DL_CTRL_2P5_POS)
#define CCI_AUPLL_DL_CTRL_2P5_UMSK (~(((1U << CCI_AUPLL_DL_CTRL_2P5_LEN) - 1) << CCI_AUPLL_DL_CTRL_2P5_POS))
#define CCI_AUPLL_DL_CTRL_2        CCI_AUPLL_DL_CTRL_2
#define CCI_AUPLL_DL_CTRL_2_POS    (30U)
#define CCI_AUPLL_DL_CTRL_2_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_2_MSK    (((1U << CCI_AUPLL_DL_CTRL_2_LEN) - 1) << CCI_AUPLL_DL_CTRL_2_POS)
#define CCI_AUPLL_DL_CTRL_2_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_2_LEN) - 1) << CCI_AUPLL_DL_CTRL_2_POS))
#define CCI_AUPLL_DL_CTRL_1        CCI_AUPLL_DL_CTRL_1
#define CCI_AUPLL_DL_CTRL_1_POS    (31U)
#define CCI_AUPLL_DL_CTRL_1_LEN    (1U)
#define CCI_AUPLL_DL_CTRL_1_MSK    (((1U << CCI_AUPLL_DL_CTRL_1_LEN) - 1) << CCI_AUPLL_DL_CTRL_1_POS)
#define CCI_AUPLL_DL_CTRL_1_UMSK   (~(((1U << CCI_AUPLL_DL_CTRL_1_LEN) - 1) << CCI_AUPLL_DL_CTRL_1_POS))

/* 0x7D0 : cpu_pll_cfg0 */
#define CCI_CPU_PLL_CFG0_OFFSET      (0x7D0)
#define CCI_CPUPLL_SDM_RSTB          CCI_CPUPLL_SDM_RSTB
#define CCI_CPUPLL_SDM_RSTB_POS      (0U)
#define CCI_CPUPLL_SDM_RSTB_LEN      (1U)
#define CCI_CPUPLL_SDM_RSTB_MSK      (((1U << CCI_CPUPLL_SDM_RSTB_LEN) - 1) << CCI_CPUPLL_SDM_RSTB_POS)
#define CCI_CPUPLL_SDM_RSTB_UMSK     (~(((1U << CCI_CPUPLL_SDM_RSTB_LEN) - 1) << CCI_CPUPLL_SDM_RSTB_POS))
#define CCI_CPUPLL_POSTDIV_RSTB      CCI_CPUPLL_POSTDIV_RSTB
#define CCI_CPUPLL_POSTDIV_RSTB_POS  (1U)
#define CCI_CPUPLL_POSTDIV_RSTB_LEN  (1U)
#define CCI_CPUPLL_POSTDIV_RSTB_MSK  (((1U << CCI_CPUPLL_POSTDIV_RSTB_LEN) - 1) << CCI_CPUPLL_POSTDIV_RSTB_POS)
#define CCI_CPUPLL_POSTDIV_RSTB_UMSK (~(((1U << CCI_CPUPLL_POSTDIV_RSTB_LEN) - 1) << CCI_CPUPLL_POSTDIV_RSTB_POS))
#define CCI_CPUPLL_FBDV_RSTB         CCI_CPUPLL_FBDV_RSTB
#define CCI_CPUPLL_FBDV_RSTB_POS     (2U)
#define CCI_CPUPLL_FBDV_RSTB_LEN     (1U)
#define CCI_CPUPLL_FBDV_RSTB_MSK     (((1U << CCI_CPUPLL_FBDV_RSTB_LEN) - 1) << CCI_CPUPLL_FBDV_RSTB_POS)
#define CCI_CPUPLL_FBDV_RSTB_UMSK    (~(((1U << CCI_CPUPLL_FBDV_RSTB_LEN) - 1) << CCI_CPUPLL_FBDV_RSTB_POS))
#define CCI_CPUPLL_REFDIV_RSTB       CCI_CPUPLL_REFDIV_RSTB
#define CCI_CPUPLL_REFDIV_RSTB_POS   (3U)
#define CCI_CPUPLL_REFDIV_RSTB_LEN   (1U)
#define CCI_CPUPLL_REFDIV_RSTB_MSK   (((1U << CCI_CPUPLL_REFDIV_RSTB_LEN) - 1) << CCI_CPUPLL_REFDIV_RSTB_POS)
#define CCI_CPUPLL_REFDIV_RSTB_UMSK  (~(((1U << CCI_CPUPLL_REFDIV_RSTB_LEN) - 1) << CCI_CPUPLL_REFDIV_RSTB_POS))
#define CCI_PU_CPUPLL_POSTDIV        CCI_PU_CPUPLL_POSTDIV
#define CCI_PU_CPUPLL_POSTDIV_POS    (4U)
#define CCI_PU_CPUPLL_POSTDIV_LEN    (1U)
#define CCI_PU_CPUPLL_POSTDIV_MSK    (((1U << CCI_PU_CPUPLL_POSTDIV_LEN) - 1) << CCI_PU_CPUPLL_POSTDIV_POS)
#define CCI_PU_CPUPLL_POSTDIV_UMSK   (~(((1U << CCI_PU_CPUPLL_POSTDIV_LEN) - 1) << CCI_PU_CPUPLL_POSTDIV_POS))
#define CCI_PU_CPUPLL_FBDV           CCI_PU_CPUPLL_FBDV
#define CCI_PU_CPUPLL_FBDV_POS       (5U)
#define CCI_PU_CPUPLL_FBDV_LEN       (1U)
#define CCI_PU_CPUPLL_FBDV_MSK       (((1U << CCI_PU_CPUPLL_FBDV_LEN) - 1) << CCI_PU_CPUPLL_FBDV_POS)
#define CCI_PU_CPUPLL_FBDV_UMSK      (~(((1U << CCI_PU_CPUPLL_FBDV_LEN) - 1) << CCI_PU_CPUPLL_FBDV_POS))
#define CCI_PU_CPUPLL_CLAMP_OP       CCI_PU_CPUPLL_CLAMP_OP
#define CCI_PU_CPUPLL_CLAMP_OP_POS   (6U)
#define CCI_PU_CPUPLL_CLAMP_OP_LEN   (1U)
#define CCI_PU_CPUPLL_CLAMP_OP_MSK   (((1U << CCI_PU_CPUPLL_CLAMP_OP_LEN) - 1) << CCI_PU_CPUPLL_CLAMP_OP_POS)
#define CCI_PU_CPUPLL_CLAMP_OP_UMSK  (~(((1U << CCI_PU_CPUPLL_CLAMP_OP_LEN) - 1) << CCI_PU_CPUPLL_CLAMP_OP_POS))
#define CCI_PU_CPUPLL_PFD            CCI_PU_CPUPLL_PFD
#define CCI_PU_CPUPLL_PFD_POS        (7U)
#define CCI_PU_CPUPLL_PFD_LEN        (1U)
#define CCI_PU_CPUPLL_PFD_MSK        (((1U << CCI_PU_CPUPLL_PFD_LEN) - 1) << CCI_PU_CPUPLL_PFD_POS)
#define CCI_PU_CPUPLL_PFD_UMSK       (~(((1U << CCI_PU_CPUPLL_PFD_LEN) - 1) << CCI_PU_CPUPLL_PFD_POS))
#define CCI_PU_CPUPLL_CP             CCI_PU_CPUPLL_CP
#define CCI_PU_CPUPLL_CP_POS         (8U)
#define CCI_PU_CPUPLL_CP_LEN         (1U)
#define CCI_PU_CPUPLL_CP_MSK         (((1U << CCI_PU_CPUPLL_CP_LEN) - 1) << CCI_PU_CPUPLL_CP_POS)
#define CCI_PU_CPUPLL_CP_UMSK        (~(((1U << CCI_PU_CPUPLL_CP_LEN) - 1) << CCI_PU_CPUPLL_CP_POS))
#define CCI_PU_CPUPLL_SFREG          CCI_PU_CPUPLL_SFREG
#define CCI_PU_CPUPLL_SFREG_POS      (9U)
#define CCI_PU_CPUPLL_SFREG_LEN      (1U)
#define CCI_PU_CPUPLL_SFREG_MSK      (((1U << CCI_PU_CPUPLL_SFREG_LEN) - 1) << CCI_PU_CPUPLL_SFREG_POS)
#define CCI_PU_CPUPLL_SFREG_UMSK     (~(((1U << CCI_PU_CPUPLL_SFREG_LEN) - 1) << CCI_PU_CPUPLL_SFREG_POS))
#define CCI_PU_CPUPLL                CCI_PU_CPUPLL
#define CCI_PU_CPUPLL_POS            (10U)
#define CCI_PU_CPUPLL_LEN            (1U)
#define CCI_PU_CPUPLL_MSK            (((1U << CCI_PU_CPUPLL_LEN) - 1) << CCI_PU_CPUPLL_POS)
#define CCI_PU_CPUPLL_UMSK           (~(((1U << CCI_PU_CPUPLL_LEN) - 1) << CCI_PU_CPUPLL_POS))
#define CCI_PU_CPUPLL_CLKTREE        CCI_PU_CPUPLL_CLKTREE
#define CCI_PU_CPUPLL_CLKTREE_POS    (11U)
#define CCI_PU_CPUPLL_CLKTREE_LEN    (1U)
#define CCI_PU_CPUPLL_CLKTREE_MSK    (((1U << CCI_PU_CPUPLL_CLKTREE_LEN) - 1) << CCI_PU_CPUPLL_CLKTREE_POS)
#define CCI_PU_CPUPLL_CLKTREE_UMSK   (~(((1U << CCI_PU_CPUPLL_CLKTREE_LEN) - 1) << CCI_PU_CPUPLL_CLKTREE_POS))

/* 0x7D4 : cpu_pll_cfg1 */
#define CCI_CPU_PLL_CFG1_OFFSET      (0x7D4)
#define CCI_CPUPLL_POSTDIV           CCI_CPUPLL_POSTDIV
#define CCI_CPUPLL_POSTDIV_POS       (0U)
#define CCI_CPUPLL_POSTDIV_LEN       (7U)
#define CCI_CPUPLL_POSTDIV_MSK       (((1U << CCI_CPUPLL_POSTDIV_LEN) - 1) << CCI_CPUPLL_POSTDIV_POS)
#define CCI_CPUPLL_POSTDIV_UMSK      (~(((1U << CCI_CPUPLL_POSTDIV_LEN) - 1) << CCI_CPUPLL_POSTDIV_POS))
#define CCI_CPUPLL_REFDIV_RATIO      CCI_CPUPLL_REFDIV_RATIO
#define CCI_CPUPLL_REFDIV_RATIO_POS  (8U)
#define CCI_CPUPLL_REFDIV_RATIO_LEN  (4U)
#define CCI_CPUPLL_REFDIV_RATIO_MSK  (((1U << CCI_CPUPLL_REFDIV_RATIO_LEN) - 1) << CCI_CPUPLL_REFDIV_RATIO_POS)
#define CCI_CPUPLL_REFDIV_RATIO_UMSK (~(((1U << CCI_CPUPLL_REFDIV_RATIO_LEN) - 1) << CCI_CPUPLL_REFDIV_RATIO_POS))
#define CCI_CPUPLL_REFCLK_SEL        CCI_CPUPLL_REFCLK_SEL
#define CCI_CPUPLL_REFCLK_SEL_POS    (16U)
#define CCI_CPUPLL_REFCLK_SEL_LEN    (2U)
#define CCI_CPUPLL_REFCLK_SEL_MSK    (((1U << CCI_CPUPLL_REFCLK_SEL_LEN) - 1) << CCI_CPUPLL_REFCLK_SEL_POS)
#define CCI_CPUPLL_REFCLK_SEL_UMSK   (~(((1U << CCI_CPUPLL_REFCLK_SEL_LEN) - 1) << CCI_CPUPLL_REFCLK_SEL_POS))
#define CCI_CPUPLL_VG11_SEL          CCI_CPUPLL_VG11_SEL
#define CCI_CPUPLL_VG11_SEL_POS      (20U)
#define CCI_CPUPLL_VG11_SEL_LEN      (2U)
#define CCI_CPUPLL_VG11_SEL_MSK      (((1U << CCI_CPUPLL_VG11_SEL_LEN) - 1) << CCI_CPUPLL_VG11_SEL_POS)
#define CCI_CPUPLL_VG11_SEL_UMSK     (~(((1U << CCI_CPUPLL_VG11_SEL_LEN) - 1) << CCI_CPUPLL_VG11_SEL_POS))
#define CCI_CPUPLL_VG13_SEL          CCI_CPUPLL_VG13_SEL
#define CCI_CPUPLL_VG13_SEL_POS      (24U)
#define CCI_CPUPLL_VG13_SEL_LEN      (2U)
#define CCI_CPUPLL_VG13_SEL_MSK      (((1U << CCI_CPUPLL_VG13_SEL_LEN) - 1) << CCI_CPUPLL_VG13_SEL_POS)
#define CCI_CPUPLL_VG13_SEL_UMSK     (~(((1U << CCI_CPUPLL_VG13_SEL_LEN) - 1) << CCI_CPUPLL_VG13_SEL_POS))

