RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/cci_reg.h
/* 0x7D8 : cpu_pll_cfg2 */
#define CCI_CPU_PLL_CFG2_OFFSET       (0x7D8)
#define CCI_CPUPLL_SEL_CP_BIAS        CCI_CPUPLL_SEL_CP_BIAS
#define CCI_CPUPLL_SEL_CP_BIAS_POS    (0U)
#define CCI_CPUPLL_SEL_CP_BIAS_LEN    (1U)
#define CCI_CPUPLL_SEL_CP_BIAS_MSK    (((1U << CCI_CPUPLL_SEL_CP_BIAS_LEN) - 1) << CCI_CPUPLL_SEL_CP_BIAS_POS)
#define CCI_CPUPLL_SEL_CP_BIAS_UMSK   (~(((1U << CCI_CPUPLL_SEL_CP_BIAS_LEN) - 1) << CCI_CPUPLL_SEL_CP_BIAS_POS))
#define CCI_CPUPLL_ICP_5U             CCI_CPUPLL_ICP_5U
#define CCI_CPUPLL_ICP_5U_POS         (4U)
#define CCI_CPUPLL_ICP_5U_LEN         (2U)
#define CCI_CPUPLL_ICP_5U_MSK         (((1U << CCI_CPUPLL_ICP_5U_LEN) - 1) << CCI_CPUPLL_ICP_5U_POS)
#define CCI_CPUPLL_ICP_5U_UMSK        (~(((1U << CCI_CPUPLL_ICP_5U_LEN) - 1) << CCI_CPUPLL_ICP_5U_POS))
#define CCI_CPUPLL_ICP_1U             CCI_CPUPLL_ICP_1U
#define CCI_CPUPLL_ICP_1U_POS         (6U)
#define CCI_CPUPLL_ICP_1U_LEN         (2U)
#define CCI_CPUPLL_ICP_1U_MSK         (((1U << CCI_CPUPLL_ICP_1U_LEN) - 1) << CCI_CPUPLL_ICP_1U_POS)
#define CCI_CPUPLL_ICP_1U_UMSK        (~(((1U << CCI_CPUPLL_ICP_1U_LEN) - 1) << CCI_CPUPLL_ICP_1U_POS))
#define CCI_CPUPLL_INT_FRAC_SW        CCI_CPUPLL_INT_FRAC_SW
#define CCI_CPUPLL_INT_FRAC_SW_POS    (8U)
#define CCI_CPUPLL_INT_FRAC_SW_LEN    (1U)
#define CCI_CPUPLL_INT_FRAC_SW_MSK    (((1U << CCI_CPUPLL_INT_FRAC_SW_LEN) - 1) << CCI_CPUPLL_INT_FRAC_SW_POS)
#define CCI_CPUPLL_INT_FRAC_SW_UMSK   (~(((1U << CCI_CPUPLL_INT_FRAC_SW_LEN) - 1) << CCI_CPUPLL_INT_FRAC_SW_POS))
#define CCI_CPUPLL_CP_STARTUP_EN      CCI_CPUPLL_CP_STARTUP_EN
#define CCI_CPUPLL_CP_STARTUP_EN_POS  (9U)
#define CCI_CPUPLL_CP_STARTUP_EN_LEN  (1U)
#define CCI_CPUPLL_CP_STARTUP_EN_MSK  (((1U << CCI_CPUPLL_CP_STARTUP_EN_LEN) - 1) << CCI_CPUPLL_CP_STARTUP_EN_POS)
#define CCI_CPUPLL_CP_STARTUP_EN_UMSK (~(((1U << CCI_CPUPLL_CP_STARTUP_EN_LEN) - 1) << CCI_CPUPLL_CP_STARTUP_EN_POS))
#define CCI_CPUPLL_CP_OPAMP_EN        CCI_CPUPLL_CP_OPAMP_EN
#define CCI_CPUPLL_CP_OPAMP_EN_POS    (10U)
#define CCI_CPUPLL_CP_OPAMP_EN_LEN    (1U)
#define CCI_CPUPLL_CP_OPAMP_EN_MSK    (((1U << CCI_CPUPLL_CP_OPAMP_EN_LEN) - 1) << CCI_CPUPLL_CP_OPAMP_EN_POS)
#define CCI_CPUPLL_CP_OPAMP_EN_UMSK   (~(((1U << CCI_CPUPLL_CP_OPAMP_EN_LEN) - 1) << CCI_CPUPLL_CP_OPAMP_EN_POS))

/* 0x7DC : cpu_pll_cfg3 */
#define CCI_CPU_PLL_CFG3_OFFSET  (0x7DC)
#define CCI_CPUPLL_C4_EN         CCI_CPUPLL_C4_EN
#define CCI_CPUPLL_C4_EN_POS     (0U)
#define CCI_CPUPLL_C4_EN_LEN     (1U)
#define CCI_CPUPLL_C4_EN_MSK     (((1U << CCI_CPUPLL_C4_EN_LEN) - 1) << CCI_CPUPLL_C4_EN_POS)
#define CCI_CPUPLL_C4_EN_UMSK    (~(((1U << CCI_CPUPLL_C4_EN_LEN) - 1) << CCI_CPUPLL_C4_EN_POS))
#define CCI_CPUPLL_R4            CCI_CPUPLL_R4
#define CCI_CPUPLL_R4_POS        (4U)
#define CCI_CPUPLL_R4_LEN        (2U)
#define CCI_CPUPLL_R4_MSK        (((1U << CCI_CPUPLL_R4_LEN) - 1) << CCI_CPUPLL_R4_POS)
#define CCI_CPUPLL_R4_UMSK       (~(((1U << CCI_CPUPLL_R4_LEN) - 1) << CCI_CPUPLL_R4_POS))
#define CCI_CPUPLL_R4_SHORT      CCI_CPUPLL_R4_SHORT
#define CCI_CPUPLL_R4_SHORT_POS  (8U)
#define CCI_CPUPLL_R4_SHORT_LEN  (1U)
#define CCI_CPUPLL_R4_SHORT_MSK  (((1U << CCI_CPUPLL_R4_SHORT_LEN) - 1) << CCI_CPUPLL_R4_SHORT_POS)
#define CCI_CPUPLL_R4_SHORT_UMSK (~(((1U << CCI_CPUPLL_R4_SHORT_LEN) - 1) << CCI_CPUPLL_R4_SHORT_POS))
#define CCI_CPUPLL_C3            CCI_CPUPLL_C3
#define CCI_CPUPLL_C3_POS        (12U)
#define CCI_CPUPLL_C3_LEN        (2U)
#define CCI_CPUPLL_C3_MSK        (((1U << CCI_CPUPLL_C3_LEN) - 1) << CCI_CPUPLL_C3_POS)
#define CCI_CPUPLL_C3_UMSK       (~(((1U << CCI_CPUPLL_C3_LEN) - 1) << CCI_CPUPLL_C3_POS))
#define CCI_CPUPLL_CZ            CCI_CPUPLL_CZ
#define CCI_CPUPLL_CZ_POS        (14U)
#define CCI_CPUPLL_CZ_LEN        (2U)
#define CCI_CPUPLL_CZ_MSK        (((1U << CCI_CPUPLL_CZ_LEN) - 1) << CCI_CPUPLL_CZ_POS)
#define CCI_CPUPLL_CZ_UMSK       (~(((1U << CCI_CPUPLL_CZ_LEN) - 1) << CCI_CPUPLL_CZ_POS))
#define CCI_CPUPLL_RZ            CCI_CPUPLL_RZ
#define CCI_CPUPLL_RZ_POS        (16U)
#define CCI_CPUPLL_RZ_LEN        (3U)
#define CCI_CPUPLL_RZ_MSK        (((1U << CCI_CPUPLL_RZ_LEN) - 1) << CCI_CPUPLL_RZ_POS)
#define CCI_CPUPLL_RZ_UMSK       (~(((1U << CCI_CPUPLL_RZ_LEN) - 1) << CCI_CPUPLL_RZ_POS))

/* 0x7E0 : cpu_pll_cfg4 */
#define CCI_CPU_PLL_CFG4_OFFSET        (0x7E0)
#define CCI_CPUPLL_SEL_SAMPLE_CLK      CCI_CPUPLL_SEL_SAMPLE_CLK
#define CCI_CPUPLL_SEL_SAMPLE_CLK_POS  (0U)
#define CCI_CPUPLL_SEL_SAMPLE_CLK_LEN  (2U)
#define CCI_CPUPLL_SEL_SAMPLE_CLK_MSK  (((1U << CCI_CPUPLL_SEL_SAMPLE_CLK_LEN) - 1) << CCI_CPUPLL_SEL_SAMPLE_CLK_POS)
#define CCI_CPUPLL_SEL_SAMPLE_CLK_UMSK (~(((1U << CCI_CPUPLL_SEL_SAMPLE_CLK_LEN) - 1) << CCI_CPUPLL_SEL_SAMPLE_CLK_POS))
#define CCI_CPUPLL_SEL_FB_CLK          CCI_CPUPLL_SEL_FB_CLK
#define CCI_CPUPLL_SEL_FB_CLK_POS      (4U)
#define CCI_CPUPLL_SEL_FB_CLK_LEN      (2U)
#define CCI_CPUPLL_SEL_FB_CLK_MSK      (((1U << CCI_CPUPLL_SEL_FB_CLK_LEN) - 1) << CCI_CPUPLL_SEL_FB_CLK_POS)
#define CCI_CPUPLL_SEL_FB_CLK_UMSK     (~(((1U << CCI_CPUPLL_SEL_FB_CLK_LEN) - 1) << CCI_CPUPLL_SEL_FB_CLK_POS))
#define CCI_CPUPLL_SDMCLK_SEL          CCI_CPUPLL_SDMCLK_SEL
#define CCI_CPUPLL_SDMCLK_SEL_POS      (8U)
#define CCI_CPUPLL_SDMCLK_SEL_LEN      (1U)
#define CCI_CPUPLL_SDMCLK_SEL_MSK      (((1U << CCI_CPUPLL_SDMCLK_SEL_LEN) - 1) << CCI_CPUPLL_SDMCLK_SEL_POS)
#define CCI_CPUPLL_SDMCLK_SEL_UMSK     (~(((1U << CCI_CPUPLL_SDMCLK_SEL_LEN) - 1) << CCI_CPUPLL_SDMCLK_SEL_POS))

/* 0x7E4 : cpu_pll_cfg5 */
#define CCI_CPU_PLL_CFG5_OFFSET   (0x7E4)
#define CCI_CPUPLL_VCO_SPEED      CCI_CPUPLL_VCO_SPEED
#define CCI_CPUPLL_VCO_SPEED_POS  (0U)
#define CCI_CPUPLL_VCO_SPEED_LEN  (3U)
#define CCI_CPUPLL_VCO_SPEED_MSK  (((1U << CCI_CPUPLL_VCO_SPEED_LEN) - 1) << CCI_CPUPLL_VCO_SPEED_POS)
#define CCI_CPUPLL_VCO_SPEED_UMSK (~(((1U << CCI_CPUPLL_VCO_SPEED_LEN) - 1) << CCI_CPUPLL_VCO_SPEED_POS))

/* 0x7E8 : cpu_pll_cfg6 */
#define CCI_CPU_PLL_CFG6_OFFSET    (0x7E8)
#define CCI_CPUPLL_SDMIN           CCI_CPUPLL_SDMIN
#define CCI_CPUPLL_SDMIN_POS       (0U)
#define CCI_CPUPLL_SDMIN_LEN       (19U)
#define CCI_CPUPLL_SDMIN_MSK       (((1U << CCI_CPUPLL_SDMIN_LEN) - 1) << CCI_CPUPLL_SDMIN_POS)
#define CCI_CPUPLL_SDMIN_UMSK      (~(((1U << CCI_CPUPLL_SDMIN_LEN) - 1) << CCI_CPUPLL_SDMIN_POS))
#define CCI_CPUPLL_SDM_BYPASS      CCI_CPUPLL_SDM_BYPASS
#define CCI_CPUPLL_SDM_BYPASS_POS  (24U)
#define CCI_CPUPLL_SDM_BYPASS_LEN  (1U)
#define CCI_CPUPLL_SDM_BYPASS_MSK  (((1U << CCI_CPUPLL_SDM_BYPASS_LEN) - 1) << CCI_CPUPLL_SDM_BYPASS_POS)
#define CCI_CPUPLL_SDM_BYPASS_UMSK (~(((1U << CCI_CPUPLL_SDM_BYPASS_LEN) - 1) << CCI_CPUPLL_SDM_BYPASS_POS))

/* 0x7EC : cpu_pll_cfg7 */
#define CCI_CPU_PLL_CFG7_OFFSET          (0x7EC)
#define CCI_CPUPLL_SDM_ORDER_SEL         CCI_CPUPLL_SDM_ORDER_SEL
#define CCI_CPUPLL_SDM_ORDER_SEL_POS     (0U)
#define CCI_CPUPLL_SDM_ORDER_SEL_LEN     (1U)
#define CCI_CPUPLL_SDM_ORDER_SEL_MSK     (((1U << CCI_CPUPLL_SDM_ORDER_SEL_LEN) - 1) << CCI_CPUPLL_SDM_ORDER_SEL_POS)
#define CCI_CPUPLL_SDM_ORDER_SEL_UMSK    (~(((1U << CCI_CPUPLL_SDM_ORDER_SEL_LEN) - 1) << CCI_CPUPLL_SDM_ORDER_SEL_POS))
#define CCI_CPUPLL_SDM_SIG_DITH_SEL      CCI_CPUPLL_SDM_SIG_DITH_SEL
#define CCI_CPUPLL_SDM_SIG_DITH_SEL_POS  (16U)
#define CCI_CPUPLL_SDM_SIG_DITH_SEL_LEN  (2U)
#define CCI_CPUPLL_SDM_SIG_DITH_SEL_MSK  (((1U << CCI_CPUPLL_SDM_SIG_DITH_SEL_LEN) - 1) << CCI_CPUPLL_SDM_SIG_DITH_SEL_POS)
#define CCI_CPUPLL_SDM_SIG_DITH_SEL_UMSK (~(((1U << CCI_CPUPLL_SDM_SIG_DITH_SEL_LEN) - 1) << CCI_CPUPLL_SDM_SIG_DITH_SEL_POS))

/* 0x7F0 : cpu_pll_cfg8 */
#define CCI_CPU_PLL_CFG8_OFFSET       (0x7F0)
#define CCI_CPUPLL_EN_DIV1            CCI_CPUPLL_EN_DIV1
#define CCI_CPUPLL_EN_DIV1_POS        (0U)
#define CCI_CPUPLL_EN_DIV1_LEN        (1U)
#define CCI_CPUPLL_EN_DIV1_MSK        (((1U << CCI_CPUPLL_EN_DIV1_LEN) - 1) << CCI_CPUPLL_EN_DIV1_POS)
#define CCI_CPUPLL_EN_DIV1_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV1_LEN) - 1) << CCI_CPUPLL_EN_DIV1_POS))
#define CCI_CPUPLL_EN_DIV2            CCI_CPUPLL_EN_DIV2
#define CCI_CPUPLL_EN_DIV2_POS        (1U)
#define CCI_CPUPLL_EN_DIV2_LEN        (1U)
#define CCI_CPUPLL_EN_DIV2_MSK        (((1U << CCI_CPUPLL_EN_DIV2_LEN) - 1) << CCI_CPUPLL_EN_DIV2_POS)
#define CCI_CPUPLL_EN_DIV2_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV2_LEN) - 1) << CCI_CPUPLL_EN_DIV2_POS))
#define CCI_CPUPLL_EN_DIV2P5          CCI_CPUPLL_EN_DIV2P5
#define CCI_CPUPLL_EN_DIV2P5_POS      (2U)
#define CCI_CPUPLL_EN_DIV2P5_LEN      (1U)
#define CCI_CPUPLL_EN_DIV2P5_MSK      (((1U << CCI_CPUPLL_EN_DIV2P5_LEN) - 1) << CCI_CPUPLL_EN_DIV2P5_POS)
#define CCI_CPUPLL_EN_DIV2P5_UMSK     (~(((1U << CCI_CPUPLL_EN_DIV2P5_LEN) - 1) << CCI_CPUPLL_EN_DIV2P5_POS))
#define CCI_CPUPLL_EN_DIV3            CCI_CPUPLL_EN_DIV3
#define CCI_CPUPLL_EN_DIV3_POS        (3U)
#define CCI_CPUPLL_EN_DIV3_LEN        (1U)
#define CCI_CPUPLL_EN_DIV3_MSK        (((1U << CCI_CPUPLL_EN_DIV3_LEN) - 1) << CCI_CPUPLL_EN_DIV3_POS)
#define CCI_CPUPLL_EN_DIV3_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV3_LEN) - 1) << CCI_CPUPLL_EN_DIV3_POS))
#define CCI_CPUPLL_EN_DIV4            CCI_CPUPLL_EN_DIV4
#define CCI_CPUPLL_EN_DIV4_POS        (4U)
#define CCI_CPUPLL_EN_DIV4_LEN        (1U)
#define CCI_CPUPLL_EN_DIV4_MSK        (((1U << CCI_CPUPLL_EN_DIV4_LEN) - 1) << CCI_CPUPLL_EN_DIV4_POS)
#define CCI_CPUPLL_EN_DIV4_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV4_LEN) - 1) << CCI_CPUPLL_EN_DIV4_POS))
#define CCI_CPUPLL_EN_DIV5            CCI_CPUPLL_EN_DIV5
#define CCI_CPUPLL_EN_DIV5_POS        (5U)
#define CCI_CPUPLL_EN_DIV5_LEN        (1U)
#define CCI_CPUPLL_EN_DIV5_MSK        (((1U << CCI_CPUPLL_EN_DIV5_LEN) - 1) << CCI_CPUPLL_EN_DIV5_POS)
#define CCI_CPUPLL_EN_DIV5_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV5_LEN) - 1) << CCI_CPUPLL_EN_DIV5_POS))
#define CCI_CPUPLL_EN_DIV6            CCI_CPUPLL_EN_DIV6
#define CCI_CPUPLL_EN_DIV6_POS        (6U)
#define CCI_CPUPLL_EN_DIV6_LEN        (1U)
#define CCI_CPUPLL_EN_DIV6_MSK        (((1U << CCI_CPUPLL_EN_DIV6_LEN) - 1) << CCI_CPUPLL_EN_DIV6_POS)
#define CCI_CPUPLL_EN_DIV6_UMSK       (~(((1U << CCI_CPUPLL_EN_DIV6_LEN) - 1) << CCI_CPUPLL_EN_DIV6_POS))
#define CCI_CPUPLL_EN_DIV10           CCI_CPUPLL_EN_DIV10
#define CCI_CPUPLL_EN_DIV10_POS       (7U)
#define CCI_CPUPLL_EN_DIV10_LEN       (1U)
#define CCI_CPUPLL_EN_DIV10_MSK       (((1U << CCI_CPUPLL_EN_DIV10_LEN) - 1) << CCI_CPUPLL_EN_DIV10_POS)
#define CCI_CPUPLL_EN_DIV10_UMSK      (~(((1U << CCI_CPUPLL_EN_DIV10_LEN) - 1) << CCI_CPUPLL_EN_DIV10_POS))
#define CCI_CPUPLL_EN_DIV15           CCI_CPUPLL_EN_DIV15
#define CCI_CPUPLL_EN_DIV15_POS       (8U)
#define CCI_CPUPLL_EN_DIV15_LEN       (1U)
#define CCI_CPUPLL_EN_DIV15_MSK       (((1U << CCI_CPUPLL_EN_DIV15_LEN) - 1) << CCI_CPUPLL_EN_DIV15_POS)
#define CCI_CPUPLL_EN_DIV15_UMSK      (~(((1U << CCI_CPUPLL_EN_DIV15_LEN) - 1) << CCI_CPUPLL_EN_DIV15_POS))
#define CCI_CPUPLL_SEL_DIV1_DIV2      CCI_CPUPLL_SEL_DIV1_DIV2
#define CCI_CPUPLL_SEL_DIV1_DIV2_POS  (9U)
#define CCI_CPUPLL_SEL_DIV1_DIV2_LEN  (1U)
#define CCI_CPUPLL_SEL_DIV1_DIV2_MSK  (((1U << CCI_CPUPLL_SEL_DIV1_DIV2_LEN) - 1) << CCI_CPUPLL_SEL_DIV1_DIV2_POS)
#define CCI_CPUPLL_SEL_DIV1_DIV2_UMSK (~(((1U << CCI_CPUPLL_SEL_DIV1_DIV2_LEN) - 1) << CCI_CPUPLL_SEL_DIV1_DIV2_POS))

/* 0x7F4 : cpu_pll_cfg9 */
#define CCI_CPU_PLL_CFG9_OFFSET          (0x7F4)
#define CCI_CPUPLL_DC_TP_OUT_EN          CCI_CPUPLL_DC_TP_OUT_EN
#define CCI_CPUPLL_DC_TP_OUT_EN_POS      (0U)
#define CCI_CPUPLL_DC_TP_OUT_EN_LEN      (1U)
#define CCI_CPUPLL_DC_TP_OUT_EN_MSK      (((1U << CCI_CPUPLL_DC_TP_OUT_EN_LEN) - 1) << CCI_CPUPLL_DC_TP_OUT_EN_POS)
#define CCI_CPUPLL_DC_TP_OUT_EN_UMSK     (~(((1U << CCI_CPUPLL_DC_TP_OUT_EN_LEN) - 1) << CCI_CPUPLL_DC_TP_OUT_EN_POS))
#define CCI_TEN_CPUPLL                   CCI_TEN_CPUPLL
#define CCI_TEN_CPUPLL_POS               (1U)
#define CCI_TEN_CPUPLL_LEN               (1U)
#define CCI_TEN_CPUPLL_MSK               (((1U << CCI_TEN_CPUPLL_LEN) - 1) << CCI_TEN_CPUPLL_POS)
#define CCI_TEN_CPUPLL_UMSK              (~(((1U << CCI_TEN_CPUPLL_LEN) - 1) << CCI_TEN_CPUPLL_POS))
#define CCI_TEN_CPUPLL_SFREG             CCI_TEN_CPUPLL_SFREG
#define CCI_TEN_CPUPLL_SFREG_POS         (2U)
#define CCI_TEN_CPUPLL_SFREG_LEN         (1U)
#define CCI_TEN_CPUPLL_SFREG_MSK         (((1U << CCI_TEN_CPUPLL_SFREG_LEN) - 1) << CCI_TEN_CPUPLL_SFREG_POS)
#define CCI_TEN_CPUPLL_SFREG_UMSK        (~(((1U << CCI_TEN_CPUPLL_SFREG_LEN) - 1) << CCI_TEN_CPUPLL_SFREG_POS))
#define CCI_DTEN_CPUPLL_FIN              CCI_DTEN_CPUPLL_FIN
#define CCI_DTEN_CPUPLL_FIN_POS          (4U)
#define CCI_DTEN_CPUPLL_FIN_LEN          (1U)
#define CCI_DTEN_CPUPLL_FIN_MSK          (((1U << CCI_DTEN_CPUPLL_FIN_LEN) - 1) << CCI_DTEN_CPUPLL_FIN_POS)
#define CCI_DTEN_CPUPLL_FIN_UMSK         (~(((1U << CCI_DTEN_CPUPLL_FIN_LEN) - 1) << CCI_DTEN_CPUPLL_FIN_POS))
#define CCI_DTEN_CPUPLL_FREF             CCI_DTEN_CPUPLL_FREF
#define CCI_DTEN_CPUPLL_FREF_POS         (5U)
#define CCI_DTEN_CPUPLL_FREF_LEN         (1U)
#define CCI_DTEN_CPUPLL_FREF_MSK         (((1U << CCI_DTEN_CPUPLL_FREF_LEN) - 1) << CCI_DTEN_CPUPLL_FREF_POS)
#define CCI_DTEN_CPUPLL_FREF_UMSK        (~(((1U << CCI_DTEN_CPUPLL_FREF_LEN) - 1) << CCI_DTEN_CPUPLL_FREF_POS))
#define CCI_DTEN_CPUPLL_FSDM             CCI_DTEN_CPUPLL_FSDM
#define CCI_DTEN_CPUPLL_FSDM_POS         (6U)
#define CCI_DTEN_CPUPLL_FSDM_LEN         (1U)
#define CCI_DTEN_CPUPLL_FSDM_MSK         (((1U << CCI_DTEN_CPUPLL_FSDM_LEN) - 1) << CCI_DTEN_CPUPLL_FSDM_POS)
#define CCI_DTEN_CPUPLL_FSDM_UMSK        (~(((1U << CCI_DTEN_CPUPLL_FSDM_LEN) - 1) << CCI_DTEN_CPUPLL_FSDM_POS))
#define CCI_DTEN_CPUPLL_DIV15            CCI_DTEN_CPUPLL_DIV15
#define CCI_DTEN_CPUPLL_DIV15_POS        (7U)
#define CCI_DTEN_CPUPLL_DIV15_LEN        (1U)
#define CCI_DTEN_CPUPLL_DIV15_MSK        (((1U << CCI_DTEN_CPUPLL_DIV15_LEN) - 1) << CCI_DTEN_CPUPLL_DIV15_POS)
#define CCI_DTEN_CPUPLL_DIV15_UMSK       (~(((1U << CCI_DTEN_CPUPLL_DIV15_LEN) - 1) << CCI_DTEN_CPUPLL_DIV15_POS))
#define CCI_DTEN_CPUPLL_DIV5             CCI_DTEN_CPUPLL_DIV5
#define CCI_DTEN_CPUPLL_DIV5_POS         (8U)
#define CCI_DTEN_CPUPLL_DIV5_LEN         (1U)
#define CCI_DTEN_CPUPLL_DIV5_MSK         (((1U << CCI_DTEN_CPUPLL_DIV5_LEN) - 1) << CCI_DTEN_CPUPLL_DIV5_POS)
#define CCI_DTEN_CPUPLL_DIV5_UMSK        (~(((1U << CCI_DTEN_CPUPLL_DIV5_LEN) - 1) << CCI_DTEN_CPUPLL_DIV5_POS))
#define CCI_DTEN_CPUPLL_POSTDIV_CLK      CCI_DTEN_CPUPLL_POSTDIV_CLK
#define CCI_DTEN_CPUPLL_POSTDIV_CLK_POS  (9U)
#define CCI_DTEN_CPUPLL_POSTDIV_CLK_LEN  (1U)
#define CCI_DTEN_CPUPLL_POSTDIV_CLK_MSK  (((1U << CCI_DTEN_CPUPLL_POSTDIV_CLK_LEN) - 1) << CCI_DTEN_CPUPLL_POSTDIV_CLK_POS)
#define CCI_DTEN_CPUPLL_POSTDIV_CLK_UMSK (~(((1U << CCI_DTEN_CPUPLL_POSTDIV_CLK_LEN) - 1) << CCI_DTEN_CPUPLL_POSTDIV_CLK_POS))
#define CCI_DTEST_CPUPLL_PULLDOWN        CCI_DTEST_CPUPLL_PULLDOWN
#define CCI_DTEST_CPUPLL_PULLDOWN_POS    (10U)
#define CCI_DTEST_CPUPLL_PULLDOWN_LEN    (1U)
#define CCI_DTEST_CPUPLL_PULLDOWN_MSK    (((1U << CCI_DTEST_CPUPLL_PULLDOWN_LEN) - 1) << CCI_DTEST_CPUPLL_PULLDOWN_POS)
#define CCI_DTEST_CPUPLL_PULLDOWN_UMSK   (~(((1U << CCI_DTEST_CPUPLL_PULLDOWN_LEN) - 1) << CCI_DTEST_CPUPLL_PULLDOWN_POS))

/* 0x7F8 : cpu_pll_cfg10 */
#define CCI_CPU_PLL_CFG10_OFFSET          (0x7F8)
#define CCI_CPUPLL_SSC_EN                 CCI_CPUPLL_SSC_EN
#define CCI_CPUPLL_SSC_EN_POS             (0U)
#define CCI_CPUPLL_SSC_EN_LEN             (1U)
#define CCI_CPUPLL_SSC_EN_MSK             (((1U << CCI_CPUPLL_SSC_EN_LEN) - 1) << CCI_CPUPLL_SSC_EN_POS)
#define CCI_CPUPLL_SSC_EN_UMSK            (~(((1U << CCI_CPUPLL_SSC_EN_LEN) - 1) << CCI_CPUPLL_SSC_EN_POS))
#define CCI_CPUPLL_SSC_CNT                CCI_CPUPLL_SSC_CNT
#define CCI_CPUPLL_SSC_CNT_POS            (4U)
#define CCI_CPUPLL_SSC_CNT_LEN            (8U)
#define CCI_CPUPLL_SSC_CNT_MSK            (((1U << CCI_CPUPLL_SSC_CNT_LEN) - 1) << CCI_CPUPLL_SSC_CNT_POS)
#define CCI_CPUPLL_SSC_CNT_UMSK           (~(((1U << CCI_CPUPLL_SSC_CNT_LEN) - 1) << CCI_CPUPLL_SSC_CNT_POS))
#define CCI_CPUPLL_SSC_GAIN               CCI_CPUPLL_SSC_GAIN
#define CCI_CPUPLL_SSC_GAIN_POS           (12U)
#define CCI_CPUPLL_SSC_GAIN_LEN           (3U)
#define CCI_CPUPLL_SSC_GAIN_MSK           (((1U << CCI_CPUPLL_SSC_GAIN_LEN) - 1) << CCI_CPUPLL_SSC_GAIN_POS)
#define CCI_CPUPLL_SSC_GAIN_UMSK          (~(((1U << CCI_CPUPLL_SSC_GAIN_LEN) - 1) << CCI_CPUPLL_SSC_GAIN_POS))
#define CCI_CPUPLL_SSC_START_GATE_EN      CCI_CPUPLL_SSC_START_GATE_EN
#define CCI_CPUPLL_SSC_START_GATE_EN_POS  (16U)
#define CCI_CPUPLL_SSC_START_GATE_EN_LEN  (1U)
#define CCI_CPUPLL_SSC_START_GATE_EN_MSK  (((1U << CCI_CPUPLL_SSC_START_GATE_EN_LEN) - 1) << CCI_CPUPLL_SSC_START_GATE_EN_POS)
#define CCI_CPUPLL_SSC_START_GATE_EN_UMSK (~(((1U << CCI_CPUPLL_SSC_START_GATE_EN_LEN) - 1) << CCI_CPUPLL_SSC_START_GATE_EN_POS))
#define CCI_CPUPLL_SSC_START              CCI_CPUPLL_SSC_START
#define CCI_CPUPLL_SSC_START_POS          (20U)
#define CCI_CPUPLL_SSC_START_LEN          (1U)
#define CCI_CPUPLL_SSC_START_MSK          (((1U << CCI_CPUPLL_SSC_START_LEN) - 1) << CCI_CPUPLL_SSC_START_POS)
#define CCI_CPUPLL_SSC_START_UMSK         (~(((1U << CCI_CPUPLL_SSC_START_LEN) - 1) << CCI_CPUPLL_SSC_START_POS))

/* 0x7FC : cpu_pll_cfg11 */
#define CCI_CPU_PLL_CFG11_OFFSET    (0x7FC)
#define CCI_CPUPLL_RESV             CCI_CPUPLL_RESV
#define CCI_CPUPLL_RESV_POS         (0U)
#define CCI_CPUPLL_RESV_LEN         (16U)
#define CCI_CPUPLL_RESV_MSK         (((1U << CCI_CPUPLL_RESV_LEN) - 1) << CCI_CPUPLL_RESV_POS)
#define CCI_CPUPLL_RESV_UMSK        (~(((1U << CCI_CPUPLL_RESV_LEN) - 1) << CCI_CPUPLL_RESV_POS))
#define CCI_CPUPLL_DL_CTRL_15       CCI_CPUPLL_DL_CTRL_15
#define CCI_CPUPLL_DL_CTRL_15_POS   (23U)
#define CCI_CPUPLL_DL_CTRL_15_LEN   (1U)
#define CCI_CPUPLL_DL_CTRL_15_MSK   (((1U << CCI_CPUPLL_DL_CTRL_15_LEN) - 1) << CCI_CPUPLL_DL_CTRL_15_POS)
#define CCI_CPUPLL_DL_CTRL_15_UMSK  (~(((1U << CCI_CPUPLL_DL_CTRL_15_LEN) - 1) << CCI_CPUPLL_DL_CTRL_15_POS))
#define CCI_CPUPLL_DL_CTRL_10       CCI_CPUPLL_DL_CTRL_10
#define CCI_CPUPLL_DL_CTRL_10_POS   (24U)
#define CCI_CPUPLL_DL_CTRL_10_LEN   (1U)
#define CCI_CPUPLL_DL_CTRL_10_MSK   (((1U << CCI_CPUPLL_DL_CTRL_10_LEN) - 1) << CCI_CPUPLL_DL_CTRL_10_POS)
#define CCI_CPUPLL_DL_CTRL_10_UMSK  (~(((1U << CCI_CPUPLL_DL_CTRL_10_LEN) - 1) << CCI_CPUPLL_DL_CTRL_10_POS))
#define CCI_CPUPLL_DL_CTRL_6        CCI_CPUPLL_DL_CTRL_6
#define CCI_CPUPLL_DL_CTRL_6_POS    (25U)
#define CCI_CPUPLL_DL_CTRL_6_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_6_MSK    (((1U << CCI_CPUPLL_DL_CTRL_6_LEN) - 1) << CCI_CPUPLL_DL_CTRL_6_POS)
#define CCI_CPUPLL_DL_CTRL_6_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_6_LEN) - 1) << CCI_CPUPLL_DL_CTRL_6_POS))
#define CCI_CPUPLL_DL_CTRL_5        CCI_CPUPLL_DL_CTRL_5
#define CCI_CPUPLL_DL_CTRL_5_POS    (26U)
#define CCI_CPUPLL_DL_CTRL_5_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_5_MSK    (((1U << CCI_CPUPLL_DL_CTRL_5_LEN) - 1) << CCI_CPUPLL_DL_CTRL_5_POS)
#define CCI_CPUPLL_DL_CTRL_5_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_5_LEN) - 1) << CCI_CPUPLL_DL_CTRL_5_POS))
#define CCI_CPUPLL_DL_CTRL_4        CCI_CPUPLL_DL_CTRL_4
#define CCI_CPUPLL_DL_CTRL_4_POS    (27U)
#define CCI_CPUPLL_DL_CTRL_4_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_4_MSK    (((1U << CCI_CPUPLL_DL_CTRL_4_LEN) - 1) << CCI_CPUPLL_DL_CTRL_4_POS)
#define CCI_CPUPLL_DL_CTRL_4_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_4_LEN) - 1) << CCI_CPUPLL_DL_CTRL_4_POS))
#define CCI_CPUPLL_DL_CTRL_3        CCI_CPUPLL_DL_CTRL_3
#define CCI_CPUPLL_DL_CTRL_3_POS    (28U)
#define CCI_CPUPLL_DL_CTRL_3_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_3_MSK    (((1U << CCI_CPUPLL_DL_CTRL_3_LEN) - 1) << CCI_CPUPLL_DL_CTRL_3_POS)
#define CCI_CPUPLL_DL_CTRL_3_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_3_LEN) - 1) << CCI_CPUPLL_DL_CTRL_3_POS))
#define CCI_CPUPLL_DL_CTRL_2P5      CCI_CPUPLL_DL_CTRL_2P5
#define CCI_CPUPLL_DL_CTRL_2P5_POS  (29U)
#define CCI_CPUPLL_DL_CTRL_2P5_LEN  (1U)
#define CCI_CPUPLL_DL_CTRL_2P5_MSK  (((1U << CCI_CPUPLL_DL_CTRL_2P5_LEN) - 1) << CCI_CPUPLL_DL_CTRL_2P5_POS)
#define CCI_CPUPLL_DL_CTRL_2P5_UMSK (~(((1U << CCI_CPUPLL_DL_CTRL_2P5_LEN) - 1) << CCI_CPUPLL_DL_CTRL_2P5_POS))
#define CCI_CPUPLL_DL_CTRL_2        CCI_CPUPLL_DL_CTRL_2
#define CCI_CPUPLL_DL_CTRL_2_POS    (30U)
#define CCI_CPUPLL_DL_CTRL_2_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_2_MSK    (((1U << CCI_CPUPLL_DL_CTRL_2_LEN) - 1) << CCI_CPUPLL_DL_CTRL_2_POS)
#define CCI_CPUPLL_DL_CTRL_2_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_2_LEN) - 1) << CCI_CPUPLL_DL_CTRL_2_POS))
#define CCI_CPUPLL_DL_CTRL_1        CCI_CPUPLL_DL_CTRL_1
#define CCI_CPUPLL_DL_CTRL_1_POS    (31U)
#define CCI_CPUPLL_DL_CTRL_1_LEN    (1U)
#define CCI_CPUPLL_DL_CTRL_1_MSK    (((1U << CCI_CPUPLL_DL_CTRL_1_LEN) - 1) << CCI_CPUPLL_DL_CTRL_1_POS)
#define CCI_CPUPLL_DL_CTRL_1_UMSK   (~(((1U << CCI_CPUPLL_DL_CTRL_1_LEN) - 1) << CCI_CPUPLL_DL_CTRL_1_POS))

struct cci_reg {
    /* 0x0 : cci_cfg */
    union {
        struct {
            uint32_t cci_en             : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cci_slv_sel_cci2   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cci_mas_sel_cci2   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cci_mas_hw_mode    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg_m_cci_sclk_en  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_div_m_cci_sclk : 2;  /* [ 6: 5],        r/w,        0x1 */
            uint32_t cfg_cci1_pre_read  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reg_scci_clk_inv   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reg_mcci_clk_inv   : 1;  /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_31     : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cci_cfg;

